---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewportScale
source: html/1178aa51-7472-1e2f-fd59-fe3434842cf9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewportScale Property

"View Scale"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewportScale { get; }
```